/**
 * @authors tanqichao
 * @date    2017-03-21 13:59:27
 * @module  平台使用协议
 */

import React, {Component} from 'react';
import {Link} from 'dva/router';
import Styles from './index.less';

class Agreement extends Component {
  render() {
    return (
      <div className={Styles.agreement}>
        <div className={Styles.write}>
          <Link to="/register" className="back">返回</Link>
          <h1>百泰互动服务使用协议</h1>
          <h2>一、特别提示</h2><p>
          “来推”的所有权和经营管理权归杭州百泰文化传媒有限公司所有。如需获得其所提供的相关服务，服务使用者需注册成为“来推”会员。一经完成注册程序，并经确认后，则视为完全同意“来推”合作协议的全部内容及相关使用流程。如果发生纠纷，您应自行承担事实上未认真阅读本条款的责任，不得以未仔细阅读为由进行抗辩。</p>
          <h2>二、服务内容</h2>
          <ol start=''>
            <li>“来推”服务的具体内容由“来推”根据实际情况提供。</li>
            <li>除非本服务协议另有其它明示规定，“来推”所推出的新产品、新功能、新服务，均受到本服务协议之规范。</li>
          </ol>
          <h2>三、声明与保证</h2>
          <ol>
            <li>会员提交的应用程序或网站的运行和经营严格遵守相关法律法规，所进行的推广宣传及相关经营活动合法。</li>
            <li>如实填写会员资料，提供真实、准确、完整的会员资料和网站资料。</li>
            <li>妥善保存并迅速更新会员资料和网站资料，确保它们真实、准确、及时和完整。</li>
            <li>
              合作期间会员如有包括但不仅限于以下变更：手机应用程序内容、汇款信息及联系人资料，应及时通知本平台客服人员。因会员不及时通知“来推”客服人员更新资料而造成的一切后果，由会员自行负责。会员注册成功后，应当妥善保管账号及密码，会员应当对以其账号进行的所有活动和事件负法律责任。
            </li>
            <li>会员提交的应用程序或网站默认授权“来推”平台免费为您进行相关推广，以保证您获得最大收益。</li>
          </ol>
          <h2>四、用户行为规范</h2>
          <ol start=''>
            <li><p>来推”会员在使用“来推”提供的服务时，必须遵守中华人民共和国相关法律法规的规定，会员应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为<strong>:</strong></p>
              <ol start=''>
                <li><p>上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：</p>
                  <ol start=''>
                    <li>反对宪法所确定的基本原则的；</li>
                    <li>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;</li>
                    <li>损害国家荣誉和利益的;</li>
                    <li>煽动民族仇恨、民族歧视、破坏民族团结的;</li>
                    <li>破坏国家宗教政策，宣扬邪教和封建迷信的;</li>
                    <li>散布谣言，扰乱社会秩序，破坏社会稳定的;</li>
                    <li>散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;</li>
                    <li>散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的</li>
                    <li>含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容;</li>
                    <li>含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；</li>
                  </ol>
                </li>
                <li><p>不得为任何非法目的而使用“来推”服务系统</p></li>
                <li><p>不利用“来推”提供的服务从事以下活动：</p>
                  <ol start=''>
                    <li>未经允许，进入计算机信息网络或者使用计算机信息网络资源的;</li>
                    <li>未经允许，对计算机信息网络功能进行删除、修改或者增加的；</li>
                    <li>未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；</li>
                    <li>故意制作、传播计算机病毒等破坏性程序的；</li>
                    <li>其他危害计算机信息网络安全的行为。</li>
                  </ol>
                </li>
              </ol>
            </li>
            <li><p>“来推”会员不得通过程序或人工方式进行刷量或作弊，包括但不限于如下情形是被本平台严格禁止的<strong>:</strong></p>
              <ol start=''>
                <li>指导用户点击后立即返回。</li>
                <li>指导用户不正常点击。</li>
                <li>自行或引导用户进行非法点击。</li>
                <li>采用程序或其他工具进行恶意刷新或点击。</li>
                <li>提交审核应用与实际发布应用不符，包括利用各种手段进行的恶意跳转。</li>
              </ol>
            </li>
            <li><p>
              “来推”会员违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿百泰与合作公司、关联公司，并使之免受损害。对此，“百泰”有权视用户的行为性质，“来推”有权永久性终止会员合作关系，扣留合作费用。同时，杭州百泰文化传媒有限公司保留进一步追究其导致的损失的权利</p>
            </li>
          </ol>
          <h2>五、其他重要声明</h2>
          <ol start=''>
            <li><p>免责声明 <br/></p><p>会员同意使用本平台服务所存在的风险将完全由自己承担；因其使用本平台服务而产生的一切后果也由会员自己承担，本平台对会员不承担任何责任。
              本平台不保证服务一定能满足会员的要求，也不保证服务不会中断，对服务的及时性、安全性、准确性也都不作保证。会员存放在本平台的文件，本平台不承担任何风险责任。 </p></li>
          </ol>
          <ol start='2'>
            <li><p>服务变更、中断或终止 </p>
              <ol start=''>
                <li><p>如因系统维护或升级的需要而需暂停网络服务，本平台将尽可能事先在重要页面进行通告。如发生以下任何一种情形，本平台有权随时中断或终止向会员提供服务而无需通知会员：</p>
                  <ol start=''>
                    <li>会员提供的个人资料不真实。</li>
                    <li>会员违反本协议中规定的使用规则。</li>
                  </ol>
                </li>
                <li><p>除前款所述情形外，本平台同时保留在不事先通知会员的情况下中断或终止部分或全部服务的权利，对于所有服务的中断或终止而造成的任何损失，本平台无需对会员或任何第三方承担任何责任。</p></li>
              </ol>
            </li>
            <li><p>违约赔偿 </p>
              <p className='md-fences mock-cm'>
                会员同意保障和维护本平台以及其他会员的利益，如因会员违反有关法律、法规或协议规定中的任何条款而给本平台或任何其他第三方造成损失，会员同意承担由此造成的损害赔偿责任。</p>
            </li>
          </ol>
          <ol start='4'>
            <li><p>修改协议 <br/></p><p>
              本平台有权在必要时对服务协议条款（包括但不限于本服务条款）进行修改，包括但不限于对平台的服务内容以及广告定价收费、广告收入分成比例进行调整，并无需通知会员。会员若需继续与本平台合作，须要完全接受修改后的条款内容。
              一旦相应内容发生变动，本平台将提前 15天在网站内进行公示，而不再进行个别通知。该公布行为视为“来推”已经向您通知修改内容。
              如果您不同意本平台进行的修改，有权停止使用本平台所提供服务。但如果您继续使用平台所提供服务的，则视为您已接受并愿意遵守平台所做的修改。</p></li>
          </ol>
          <ol start='5'>
            <li><p>会员自主自愿条款 </p><p>
              考虑到本平台面对会员的数量巨大和不特定性，因此直接协商，鉴此，本服务条款并不以任何形式强制要求会员接受相关内容，如会员认为任何条款未经协商缺乏公允，则可通过直接点击不接受来拒绝条款并同时拒绝本平台之服务即可，如点击接受，则视为会员接受本用户协议之全部条件，并应基于此享有权益并承担义务</p>
            </li>
          </ol>
          <p> 本协议解释权归杭州百泰文化传媒有限公司所有。</p>
        </div>
      </div>
    )
  }
}
;

export default Agreement;
